// Неявное приведение и слабая типизация
// ---------------------------------------

// console.log(10 + 'hello')

// console.log('10' + 'hello')

// console.log(3 + '8')

// console.log('10' / '5')

// --------------------------

// let a = 2
// let b = 6
// let sum = a + b
// alert('Сумма равна:' + sum)

// let a = '2'
// let b = '6'
// let sum = a * b
// alert('Сумма равна: ' + sum)
// ===============================================================

// 2. Приоритеты операторов

// console.log(2 + 2 * 8)
// ====================================================================

// 3. Оператор группировки

// console.log((2 + 2) * 8)
// ========================================================================

// 4. Ассоциативность операторов

// =====================================================================
// 5. Константы

// let myVar = 8
// myVar = 6
// alert(myVar)

// const myVar = 8
// myVar = 6
// alert(myVar)

// const numbers = [10, 8, 22]
// numbers[0] = 5
// alert(numbers)